GopalSaraf/Practicals/PSDL/include/proc/pic18f96j99.inc
// Register: LCDSE4
#define LCDSE4 LCDSE4
LCDSE4                                   equ 0ED2h
// bitfield definitions
LCDSE4_SE32_POSN                         equ 0000h
LCDSE4_SE32_POSITION                     equ 0000h
LCDSE4_SE32_SIZE                         equ 0001h
LCDSE4_SE32_LENGTH                       equ 0001h
LCDSE4_SE32_MASK                         equ 0001h
LCDSE4_SE33_POSN                         equ 0001h
LCDSE4_SE33_POSITION                     equ 0001h
LCDSE4_SE33_SIZE                         equ 0001h
LCDSE4_SE33_LENGTH                       equ 0001h
LCDSE4_SE33_MASK                         equ 0002h
LCDSE4_SE34_POSN                         equ 0002h
LCDSE4_SE34_POSITION                     equ 0002h
LCDSE4_SE34_SIZE                         equ 0001h
LCDSE4_SE34_LENGTH                       equ 0001h
LCDSE4_SE34_MASK                         equ 0004h
LCDSE4_SE35_POSN                         equ 0003h
LCDSE4_SE35_POSITION                     equ 0003h
LCDSE4_SE35_SIZE                         equ 0001h
LCDSE4_SE35_LENGTH                       equ 0001h
LCDSE4_SE35_MASK                         equ 0008h
LCDSE4_SE36_POSN                         equ 0004h
LCDSE4_SE36_POSITION                     equ 0004h
LCDSE4_SE36_SIZE                         equ 0001h
LCDSE4_SE36_LENGTH                       equ 0001h
LCDSE4_SE36_MASK                         equ 0010h
LCDSE4_SE37_POSN                         equ 0005h
LCDSE4_SE37_POSITION                     equ 0005h
LCDSE4_SE37_SIZE                         equ 0001h
LCDSE4_SE37_LENGTH                       equ 0001h
LCDSE4_SE37_MASK                         equ 0020h
LCDSE4_SE38_POSN                         equ 0006h
LCDSE4_SE38_POSITION                     equ 0006h
LCDSE4_SE38_SIZE                         equ 0001h
LCDSE4_SE38_LENGTH                       equ 0001h
LCDSE4_SE38_MASK                         equ 0040h
LCDSE4_SE39_POSN                         equ 0007h
LCDSE4_SE39_POSITION                     equ 0007h
LCDSE4_SE39_SIZE                         equ 0001h
LCDSE4_SE39_LENGTH                       equ 0001h
LCDSE4_SE39_MASK                         equ 0080h

// Register: LCDSE5
#define LCDSE5 LCDSE5
LCDSE5                                   equ 0ED3h
// bitfield definitions
LCDSE5_SE40_POSN                         equ 0000h
LCDSE5_SE40_POSITION                     equ 0000h
LCDSE5_SE40_SIZE                         equ 0001h
LCDSE5_SE40_LENGTH                       equ 0001h
LCDSE5_SE40_MASK                         equ 0001h
LCDSE5_SE41_POSN                         equ 0001h
LCDSE5_SE41_POSITION                     equ 0001h
LCDSE5_SE41_SIZE                         equ 0001h
LCDSE5_SE41_LENGTH                       equ 0001h
LCDSE5_SE41_MASK                         equ 0002h
LCDSE5_SE42_POSN                         equ 0002h
LCDSE5_SE42_POSITION                     equ 0002h
LCDSE5_SE42_SIZE                         equ 0001h
LCDSE5_SE42_LENGTH                       equ 0001h
LCDSE5_SE42_MASK                         equ 0004h
LCDSE5_SE43_POSN                         equ 0003h
LCDSE5_SE43_POSITION                     equ 0003h
LCDSE5_SE43_SIZE                         equ 0001h
LCDSE5_SE43_LENGTH                       equ 0001h
LCDSE5_SE43_MASK                         equ 0008h
LCDSE5_SE44_POSN                         equ 0004h
LCDSE5_SE44_POSITION                     equ 0004h
LCDSE5_SE44_SIZE                         equ 0001h
LCDSE5_SE44_LENGTH                       equ 0001h
LCDSE5_SE44_MASK                         equ 0010h
LCDSE5_SE45_POSN                         equ 0005h
LCDSE5_SE45_POSITION                     equ 0005h
LCDSE5_SE45_SIZE                         equ 0001h
LCDSE5_SE45_LENGTH                       equ 0001h
LCDSE5_SE45_MASK                         equ 0020h
LCDSE5_SE46_POSN                         equ 0006h
LCDSE5_SE46_POSITION                     equ 0006h
LCDSE5_SE46_SIZE                         equ 0001h
LCDSE5_SE46_LENGTH                       equ 0001h
LCDSE5_SE46_MASK                         equ 0040h
LCDSE5_SE47_POSN                         equ 0007h
LCDSE5_SE47_POSITION                     equ 0007h
LCDSE5_SE47_SIZE                         equ 0001h
LCDSE5_SE47_LENGTH                       equ 0001h
LCDSE5_SE47_MASK                         equ 0080h

// Register: LCDSE6
#define LCDSE6 LCDSE6
LCDSE6                                   equ 0ED4h
// bitfield definitions
LCDSE6_SE48_POSN                         equ 0000h
LCDSE6_SE48_POSITION                     equ 0000h
LCDSE6_SE48_SIZE                         equ 0001h
LCDSE6_SE48_LENGTH                       equ 0001h
LCDSE6_SE48_MASK                         equ 0001h
LCDSE6_SE49_POSN                         equ 0001h
LCDSE6_SE49_POSITION                     equ 0001h
LCDSE6_SE49_SIZE                         equ 0001h
LCDSE6_SE49_LENGTH                       equ 0001h
LCDSE6_SE49_MASK                         equ 0002h
LCDSE6_SE50_POSN                         equ 0002h
LCDSE6_SE50_POSITION                     equ 0002h
LCDSE6_SE50_SIZE                         equ 0001h
LCDSE6_SE50_LENGTH                       equ 0001h
LCDSE6_SE50_MASK                         equ 0004h
LCDSE6_SE51_POSN                         equ 0003h
LCDSE6_SE51_POSITION                     equ 0003h
LCDSE6_SE51_SIZE                         equ 0001h
LCDSE6_SE51_LENGTH                       equ 0001h
LCDSE6_SE51_MASK                         equ 0008h
LCDSE6_SE52_POSN                         equ 0004h
LCDSE6_SE52_POSITION                     equ 0004h
LCDSE6_SE52_SIZE                         equ 0001h
LCDSE6_SE52_LENGTH                       equ 0001h
LCDSE6_SE52_MASK                         equ 0010h
LCDSE6_SE53_POSN                         equ 0005h
LCDSE6_SE53_POSITION                     equ 0005h
LCDSE6_SE53_SIZE                         equ 0001h
LCDSE6_SE53_LENGTH                       equ 0001h
LCDSE6_SE53_MASK                         equ 0020h
LCDSE6_SE54_POSN                         equ 0006h
LCDSE6_SE54_POSITION                     equ 0006h
LCDSE6_SE54_SIZE                         equ 0001h
LCDSE6_SE54_LENGTH                       equ 0001h
LCDSE6_SE54_MASK                         equ 0040h
LCDSE6_SE55_POSN                         equ 0007h
LCDSE6_SE55_POSITION                     equ 0007h
LCDSE6_SE55_SIZE                         equ 0001h
LCDSE6_SE55_LENGTH                       equ 0001h
LCDSE6_SE55_MASK                         equ 0080h

// Register: LCDSE7
#define LCDSE7 LCDSE7
LCDSE7                                   equ 0ED5h
// bitfield definitions
LCDSE7_SE56_POSN                         equ 0000h
LCDSE7_SE56_POSITION                     equ 0000h
LCDSE7_SE56_SIZE                         equ 0001h
LCDSE7_SE56_LENGTH                       equ 0001h
LCDSE7_SE56_MASK                         equ 0001h
LCDSE7_SE57_POSN                         equ 0001h
LCDSE7_SE57_POSITION                     equ 0001h
LCDSE7_SE57_SIZE                         equ 0001h
LCDSE7_SE57_LENGTH                       equ 0001h
LCDSE7_SE57_MASK                         equ 0002h
LCDSE7_SE58_POSN                         equ 0002h
LCDSE7_SE58_POSITION                     equ 0002h
LCDSE7_SE58_SIZE                         equ 0001h
LCDSE7_SE58_LENGTH                       equ 0001h
LCDSE7_SE58_MASK                         equ 0004h
LCDSE7_SE59_POSN                         equ 0003h
LCDSE7_SE59_POSITION                     equ 0003h
LCDSE7_SE59_SIZE                         equ 0001h
LCDSE7_SE59_LENGTH                       equ 0001h
LCDSE7_SE59_MASK                         equ 0008h
LCDSE7_SE60_POSN                         equ 0004h
LCDSE7_SE60_POSITION                     equ 0004h
LCDSE7_SE60_SIZE                         equ 0001h
LCDSE7_SE60_LENGTH                       equ 0001h
LCDSE7_SE60_MASK                         equ 0010h
LCDSE7_SE61_POSN                         equ 0005h
LCDSE7_SE61_POSITION                     equ 0005h
LCDSE7_SE61_SIZE                         equ 0001h
LCDSE7_SE61_LENGTH                       equ 0001h
LCDSE7_SE61_MASK                         equ 0020h
LCDSE7_SE62_POSN                         equ 0006h
LCDSE7_SE62_POSITION                     equ 0006h
LCDSE7_SE62_SIZE                         equ 0001h
LCDSE7_SE62_LENGTH                       equ 0001h
LCDSE7_SE62_MASK                         equ 0040h
LCDSE7_SE63_POSN                         equ 0007h
LCDSE7_SE63_POSITION                     equ 0007h
LCDSE7_SE63_SIZE                         equ 0001h
LCDSE7_SE63_LENGTH                       equ 0001h
LCDSE7_SE63_MASK                         equ 0080h

// Register: LCDRL
#define LCDRL LCDRL
LCDRL                                    equ 0ED6h
// bitfield definitions
LCDRL_LRLAT_POSN                         equ 0000h
LCDRL_LRLAT_POSITION                     equ 0000h
LCDRL_LRLAT_SIZE                         equ 0003h
LCDRL_LRLAT_LENGTH                       equ 0003h
LCDRL_LRLAT_MASK                         equ 0007h
LCDRL_LRLBP_POSN                         equ 0004h
LCDRL_LRLBP_POSITION                     equ 0004h
LCDRL_LRLBP_SIZE                         equ 0002h
LCDRL_LRLBP_LENGTH                       equ 0002h
LCDRL_LRLBP_MASK                         equ 0030h
LCDRL_LRLAP_POSN                         equ 0006h
LCDRL_LRLAP_POSITION                     equ 0006h
LCDRL_LRLAP_SIZE                         equ 0002h
LCDRL_LRLAP_LENGTH                       equ 0002h
LCDRL_LRLAP_MASK                         equ 00C0h
LCDRL_LRLAT0_POSN                        equ 0000h
LCDRL_LRLAT0_POSITION                    equ 0000h
LCDRL_LRLAT0_SIZE                        equ 0001h
LCDRL_LRLAT0_LENGTH                      equ 0001h
LCDRL_LRLAT0_MASK                        equ 0001h
LCDRL_LRLAT1_POSN                        equ 0001h
LCDRL_LRLAT1_POSITION                    equ 0001h
LCDRL_LRLAT1_SIZE                        equ 0001h
LCDRL_LRLAT1_LENGTH                      equ 0001h
LCDRL_LRLAT1_MASK                        equ 0002h
LCDRL_LRLAT2_POSN                        equ 0002h
LCDRL_LRLAT2_POSITION                    equ 0002h
LCDRL_LRLAT2_SIZE                        equ 0001h
LCDRL_LRLAT2_LENGTH                      equ 0001h
LCDRL_LRLAT2_MASK                        equ 0004h
LCDRL_LRLBP0_POSN                        equ 0004h
LCDRL_LRLBP0_POSITION                    equ 0004h
LCDRL_LRLBP0_SIZE                        equ 0001h
LCDRL_LRLBP0_LENGTH                      equ 0001h
LCDRL_LRLBP0_MASK                        equ 0010h
LCDRL_LRLBP1_POSN                        equ 0005h
LCDRL_LRLBP1_POSITION                    equ 0005h
LCDRL_LRLBP1_SIZE                        equ 0001h
LCDRL_LRLBP1_LENGTH                      equ 0001h
LCDRL_LRLBP1_MASK                        equ 0020h
LCDRL_LRLAP0_POSN                        equ 0006h
LCDRL_LRLAP0_POSITION                    equ 0006h
LCDRL_LRLAP0_SIZE                        equ 0001h
LCDRL_LRLAP0_LENGTH                      equ 0001h
LCDRL_LRLAP0_MASK                        equ 0040h
LCDRL_LRLAP1_POSN                        equ 0007h
LCDRL_LRLAP1_POSITION                    equ 0007h
LCDRL_LRLAP1_SIZE                        equ 0001h
LCDRL_LRLAP1_LENGTH                      equ 0001h
LCDRL_LRLAP1_MASK                        equ 0080h

// Register: LCDREF
#define LCDREF LCDREF
LCDREF                                   equ 0ED7h
// bitfield definitions
LCDREF_VLCD1PE_POSN                      equ 0000h
LCDREF_VLCD1PE_POSITION                  equ 0000h
LCDREF_VLCD1PE_SIZE                      equ 0001h
LCDREF_VLCD1PE_LENGTH                    equ 0001h
LCDREF_VLCD1PE_MASK                      equ 0001h
LCDREF_VLCD2PE_POSN                      equ 0001h
LCDREF_VLCD2PE_POSITION                  equ 0001h
LCDREF_VLCD2PE_SIZE                      equ 0001h
LCDREF_VLCD2PE_LENGTH                    equ 0001h
LCDREF_VLCD2PE_MASK                      equ 0002h
LCDREF_VLCD3PE_POSN                      equ 0002h
LCDREF_VLCD3PE_POSITION                  equ 0002h
LCDREF_VLCD3PE_SIZE                      equ 0001h
LCDREF_VLCD3PE_LENGTH                    equ 0001h
LCDREF_VLCD3PE_MASK                      equ 0004h
LCDREF_LCDCST_POSN                       equ 0003h
LCDREF_LCDCST_POSITION                   equ 0003h
LCDREF_LCDCST_SIZE                       equ 0003h
LCDREF_LCDCST_LENGTH                     equ 0003h
LCDREF_LCDCST_MASK                       equ 0038h
LCDREF_LCDIRE_POSN                       equ 0007h
LCDREF_LCDIRE_POSITION                   equ 0007h
LCDREF_LCDIRE_SIZE                       equ 0001h
LCDREF_LCDIRE_LENGTH                     equ 0001h
LCDREF_LCDIRE_MASK                       equ 0080h
LCDREF_LCDCST0_POSN                      equ 0003h
LCDREF_LCDCST0_POSITION                  equ 0003h
LCDREF_LCDCST0_SIZE                      equ 0001h
LCDREF_LCDCST0_LENGTH                    equ 0001h
LCDREF_LCDCST0_MASK                      equ 0008h
LCDREF_LCDCST1_POSN                      equ 0004h
LCDREF_LCDCST1_POSITION                  equ 0004h
LCDREF_LCDCST1_SIZE                      equ 0001h
LCDREF_LCDCST1_LENGTH                    equ 0001h
LCDREF_LCDCST1_MASK                      equ 0010h
LCDREF_LCDCST2_POSN                      equ 0005h
LCDREF_LCDCST2_POSITION                  equ 0005h
LCDREF_LCDCST2_SIZE                      equ 0001h
LCDREF_LCDCST2_LENGTH                    equ 0001h
LCDREF_LCDCST2_MASK                      equ 0020h

// Register: LCDREG
#define LCDREG LCDREG
LCDREG                                   equ 0ED8h
// bitfield definitions
LCDREG_CLKSEL_POSN                       equ 0000h
LCDREG_CLKSEL_POSITION                   equ 0000h
LCDREG_CLKSEL_SIZE                       equ 0002h
LCDREG_CLKSEL_LENGTH                     equ 0002h
LCDREG_CLKSEL_MASK                       equ 0003h
LCDREG_MODE13_POSN                       equ 0002h
LCDREG_MODE13_POSITION                   equ 0002h
LCDREG_MODE13_SIZE                       equ 0001h
LCDREG_MODE13_LENGTH                     equ 0001h
LCDREG_MODE13_MASK                       equ 0004h
LCDREG_BIAS_POSN                         equ 0003h
LCDREG_BIAS_POSITION                     equ 0003h
LCDREG_BIAS_SIZE                         equ 0003h
LCDREG_BIAS_LENGTH                       equ 0003h
LCDREG_BIAS_MASK                         equ 0038h
LCDREG_CPEN_POSN                         equ 0007h
LCDREG_CPEN_POSITION                     equ 0007h
LCDREG_CPEN_SIZE                         equ 0001h
LCDREG_CPEN_LENGTH                       equ 0001h
LCDREG_CPEN_MASK                         equ 0080h
LCDREG_CLKSEL0_POSN                      equ 0000h
LCDREG_CLKSEL0_POSITION                  equ 0000h
LCDREG_CLKSEL0_SIZE                      equ 0001h
LCDREG_CLKSEL0_LENGTH                    equ 0001h
LCDREG_CLKSEL0_MASK                      equ 0001h
LCDREG_CLKSEL1_POSN                      equ 0001h
LCDREG_CLKSEL1_POSITION                  equ 0001h
LCDREG_CLKSEL1_SIZE                      equ 0001h
LCDREG_CLKSEL1_LENGTH                    equ 0001h
LCDREG_CLKSEL1_MASK                      equ 0002h
LCDREG_BIAS0_POSN                        equ 0003h
LCDREG_BIAS0_POSITION                    equ 0003h
LCDREG_BIAS0_SIZE                        equ 0001h
LCDREG_BIAS0_LENGTH                      equ 0001h
LCDREG_BIAS0_MASK                        equ 0008h
LCDREG_BIAS1_POSN                        equ 0004h
LCDREG_BIAS1_POSITION                    equ 0004h
LCDREG_BIAS1_SIZE                        equ 0001h
LCDREG_BIAS1_LENGTH                      equ 0001h
LCDREG_BIAS1_MASK                        equ 0010h
LCDREG_BIAS2_POSN                        equ 0005h
LCDREG_BIAS2_POSITION                    equ 0005h
LCDREG_BIAS2_SIZE                        equ 0001h
LCDREG_BIAS2_LENGTH                      equ 0001h
LCDREG_BIAS2_MASK                        equ 0020h

