GopalSaraf/Practicals/PSDL/include/proc/pic18f96j99.inc
// Register: REFO1CON
#define REFO1CON REFO1CON
REFO1CON                                 equ 0EE2h
// bitfield definitions
REFO1CON_ACTIVE_POSN                     equ 0000h
REFO1CON_ACTIVE_POSITION                 equ 0000h
REFO1CON_ACTIVE_SIZE                     equ 0001h
REFO1CON_ACTIVE_LENGTH                   equ 0001h
REFO1CON_ACTIVE_MASK                     equ 0001h
REFO1CON_DIVSWEN_POSN                    equ 0001h
REFO1CON_DIVSWEN_POSITION                equ 0001h
REFO1CON_DIVSWEN_SIZE                    equ 0001h
REFO1CON_DIVSWEN_LENGTH                  equ 0001h
REFO1CON_DIVSWEN_MASK                    equ 0002h
REFO1CON_ROSSLP_POSN                     equ 0003h
REFO1CON_ROSSLP_POSITION                 equ 0003h
REFO1CON_ROSSLP_SIZE                     equ 0001h
REFO1CON_ROSSLP_LENGTH                   equ 0001h
REFO1CON_ROSSLP_MASK                     equ 0008h
REFO1CON_ROOE_POSN                       equ 0004h
REFO1CON_ROOE_POSITION                   equ 0004h
REFO1CON_ROOE_SIZE                       equ 0001h
REFO1CON_ROOE_LENGTH                     equ 0001h
REFO1CON_ROOE_MASK                       equ 0010h
REFO1CON_ROSIDL_POSN                     equ 0005h
REFO1CON_ROSIDL_POSITION                 equ 0005h
REFO1CON_ROSIDL_SIZE                     equ 0001h
REFO1CON_ROSIDL_LENGTH                   equ 0001h
REFO1CON_ROSIDL_MASK                     equ 0020h
REFO1CON_ROON_POSN                       equ 0007h
REFO1CON_ROON_POSITION                   equ 0007h
REFO1CON_ROON_SIZE                       equ 0001h
REFO1CON_ROON_LENGTH                     equ 0001h
REFO1CON_ROON_MASK                       equ 0080h

// Register: MEMCON
#define MEMCON MEMCON
MEMCON                                   equ 0EE3h
// bitfield definitions
MEMCON_WM_POSN                           equ 0000h
MEMCON_WM_POSITION                       equ 0000h
MEMCON_WM_SIZE                           equ 0002h
MEMCON_WM_LENGTH                         equ 0002h
MEMCON_WM_MASK                           equ 0003h
MEMCON_WAIT_POSN                         equ 0004h
MEMCON_WAIT_POSITION                     equ 0004h
MEMCON_WAIT_SIZE                         equ 0002h
MEMCON_WAIT_LENGTH                       equ 0002h
MEMCON_WAIT_MASK                         equ 0030h
MEMCON_EBDIS_POSN                        equ 0007h
MEMCON_EBDIS_POSITION                    equ 0007h
MEMCON_EBDIS_SIZE                        equ 0001h
MEMCON_EBDIS_LENGTH                      equ 0001h
MEMCON_EBDIS_MASK                        equ 0080h
MEMCON_WM0_POSN                          equ 0000h
MEMCON_WM0_POSITION                      equ 0000h
MEMCON_WM0_SIZE                          equ 0001h
MEMCON_WM0_LENGTH                        equ 0001h
MEMCON_WM0_MASK                          equ 0001h
MEMCON_WM1_POSN                          equ 0001h
MEMCON_WM1_POSITION                      equ 0001h
MEMCON_WM1_SIZE                          equ 0001h
MEMCON_WM1_LENGTH                        equ 0001h
MEMCON_WM1_MASK                          equ 0002h
MEMCON_WAIT0_POSN                        equ 0004h
MEMCON_WAIT0_POSITION                    equ 0004h
MEMCON_WAIT0_SIZE                        equ 0001h
MEMCON_WAIT0_LENGTH                      equ 0001h
MEMCON_WAIT0_MASK                        equ 0010h
MEMCON_WAIT1_POSN                        equ 0005h
MEMCON_WAIT1_POSITION                    equ 0005h
MEMCON_WAIT1_SIZE                        equ 0001h
MEMCON_WAIT1_LENGTH                      equ 0001h
MEMCON_WAIT1_MASK                        equ 0020h

// Register: PORTL
#define PORTL PORTL
PORTL                                    equ 0EE4h
// bitfield definitions
PORTL_RL0_POSN                           equ 0000h
PORTL_RL0_POSITION                       equ 0000h
PORTL_RL0_SIZE                           equ 0001h
PORTL_RL0_LENGTH                         equ 0001h
PORTL_RL0_MASK                           equ 0001h
PORTL_RL1_POSN                           equ 0001h
PORTL_RL1_POSITION                       equ 0001h
PORTL_RL1_SIZE                           equ 0001h
PORTL_RL1_LENGTH                         equ 0001h
PORTL_RL1_MASK                           equ 0002h
PORTL_RL2_POSN                           equ 0002h
PORTL_RL2_POSITION                       equ 0002h
PORTL_RL2_SIZE                           equ 0001h
PORTL_RL2_LENGTH                         equ 0001h
PORTL_RL2_MASK                           equ 0004h
PORTL_RL3_POSN                           equ 0003h
PORTL_RL3_POSITION                       equ 0003h
PORTL_RL3_SIZE                           equ 0001h
PORTL_RL3_LENGTH                         equ 0001h
PORTL_RL3_MASK                           equ 0008h
PORTL_RL4_POSN                           equ 0004h
PORTL_RL4_POSITION                       equ 0004h
PORTL_RL4_SIZE                           equ 0001h
PORTL_RL4_LENGTH                         equ 0001h
PORTL_RL4_MASK                           equ 0010h
PORTL_RL5_POSN                           equ 0005h
PORTL_RL5_POSITION                       equ 0005h
PORTL_RL5_SIZE                           equ 0001h
PORTL_RL5_LENGTH                         equ 0001h
PORTL_RL5_MASK                           equ 0020h
PORTL_RL6_POSN                           equ 0006h
PORTL_RL6_POSITION                       equ 0006h
PORTL_RL6_SIZE                           equ 0001h
PORTL_RL6_LENGTH                         equ 0001h
PORTL_RL6_MASK                           equ 0040h
PORTL_RL7_POSN                           equ 0007h
PORTL_RL7_POSITION                       equ 0007h
PORTL_RL7_SIZE                           equ 0001h
PORTL_RL7_LENGTH                         equ 0001h
PORTL_RL7_MASK                           equ 0080h

// Register: LATL
#define LATL LATL
LATL                                     equ 0EE5h
// bitfield definitions
LATL_LATL0_POSN                          equ 0000h
LATL_LATL0_POSITION                      equ 0000h
LATL_LATL0_SIZE                          equ 0001h
LATL_LATL0_LENGTH                        equ 0001h
LATL_LATL0_MASK                          equ 0001h
LATL_LATL1_POSN                          equ 0001h
LATL_LATL1_POSITION                      equ 0001h
LATL_LATL1_SIZE                          equ 0001h
LATL_LATL1_LENGTH                        equ 0001h
LATL_LATL1_MASK                          equ 0002h
LATL_LATL2_POSN                          equ 0002h
LATL_LATL2_POSITION                      equ 0002h
LATL_LATL2_SIZE                          equ 0001h
LATL_LATL2_LENGTH                        equ 0001h
LATL_LATL2_MASK                          equ 0004h
LATL_LATL3_POSN                          equ 0003h
LATL_LATL3_POSITION                      equ 0003h
LATL_LATL3_SIZE                          equ 0001h
LATL_LATL3_LENGTH                        equ 0001h
LATL_LATL3_MASK                          equ 0008h
LATL_LATL4_POSN                          equ 0004h
LATL_LATL4_POSITION                      equ 0004h
LATL_LATL4_SIZE                          equ 0001h
LATL_LATL4_LENGTH                        equ 0001h
LATL_LATL4_MASK                          equ 0010h
LATL_LATL5_POSN                          equ 0005h
LATL_LATL5_POSITION                      equ 0005h
LATL_LATL5_SIZE                          equ 0001h
LATL_LATL5_LENGTH                        equ 0001h
LATL_LATL5_MASK                          equ 0020h
LATL_LATL6_POSN                          equ 0006h
LATL_LATL6_POSITION                      equ 0006h
LATL_LATL6_SIZE                          equ 0001h
LATL_LATL6_LENGTH                        equ 0001h
LATL_LATL6_MASK                          equ 0040h
LATL_LATL7_POSN                          equ 0007h
LATL_LATL7_POSITION                      equ 0007h
LATL_LATL7_SIZE                          equ 0001h
LATL_LATL7_LENGTH                        equ 0001h
LATL_LATL7_MASK                          equ 0080h
LATL_LL0_POSN                            equ 0000h
LATL_LL0_POSITION                        equ 0000h
LATL_LL0_SIZE                            equ 0001h
LATL_LL0_LENGTH                          equ 0001h
LATL_LL0_MASK                            equ 0001h
LATL_LL1_POSN                            equ 0001h
LATL_LL1_POSITION                        equ 0001h
LATL_LL1_SIZE                            equ 0001h
LATL_LL1_LENGTH                          equ 0001h
LATL_LL1_MASK                            equ 0002h
LATL_LL2_POSN                            equ 0002h
LATL_LL2_POSITION                        equ 0002h
LATL_LL2_SIZE                            equ 0001h
LATL_LL2_LENGTH                          equ 0001h
LATL_LL2_MASK                            equ 0004h
LATL_LL3_POSN                            equ 0003h
LATL_LL3_POSITION                        equ 0003h
LATL_LL3_SIZE                            equ 0001h
LATL_LL3_LENGTH                          equ 0001h
LATL_LL3_MASK                            equ 0008h
LATL_LL4_POSN                            equ 0004h
LATL_LL4_POSITION                        equ 0004h
LATL_LL4_SIZE                            equ 0001h
LATL_LL4_LENGTH                          equ 0001h
LATL_LL4_MASK                            equ 0010h
LATL_LL5_POSN                            equ 0005h
LATL_LL5_POSITION                        equ 0005h
LATL_LL5_SIZE                            equ 0001h
LATL_LL5_LENGTH                          equ 0001h
LATL_LL5_MASK                            equ 0020h
LATL_LL6_POSN                            equ 0006h
LATL_LL6_POSITION                        equ 0006h
LATL_LL6_SIZE                            equ 0001h
LATL_LL6_LENGTH                          equ 0001h
LATL_LL6_MASK                            equ 0040h
LATL_LL7_POSN                            equ 0007h
LATL_LL7_POSITION                        equ 0007h
LATL_LL7_SIZE                            equ 0001h
LATL_LL7_LENGTH                          equ 0001h
LATL_LL7_MASK                            equ 0080h

// Register: TRISL
#define TRISL TRISL
TRISL                                    equ 0EE6h
// bitfield definitions
TRISL_TRISL0_POSN                        equ 0000h
TRISL_TRISL0_POSITION                    equ 0000h
TRISL_TRISL0_SIZE                        equ 0001h
TRISL_TRISL0_LENGTH                      equ 0001h
TRISL_TRISL0_MASK                        equ 0001h
TRISL_TRISL1_POSN                        equ 0001h
TRISL_TRISL1_POSITION                    equ 0001h
TRISL_TRISL1_SIZE                        equ 0001h
TRISL_TRISL1_LENGTH                      equ 0001h
TRISL_TRISL1_MASK                        equ 0002h
TRISL_TRISL2_POSN                        equ 0002h
TRISL_TRISL2_POSITION                    equ 0002h
TRISL_TRISL2_SIZE                        equ 0001h
TRISL_TRISL2_LENGTH                      equ 0001h
TRISL_TRISL2_MASK                        equ 0004h
TRISL_TRISL3_POSN                        equ 0003h
TRISL_TRISL3_POSITION                    equ 0003h
TRISL_TRISL3_SIZE                        equ 0001h
TRISL_TRISL3_LENGTH                      equ 0001h
TRISL_TRISL3_MASK                        equ 0008h
TRISL_TRISL4_POSN                        equ 0004h
TRISL_TRISL4_POSITION                    equ 0004h
TRISL_TRISL4_SIZE                        equ 0001h
TRISL_TRISL4_LENGTH                      equ 0001h
TRISL_TRISL4_MASK                        equ 0010h
TRISL_TRISL5_POSN                        equ 0005h
TRISL_TRISL5_POSITION                    equ 0005h
TRISL_TRISL5_SIZE                        equ 0001h
TRISL_TRISL5_LENGTH                      equ 0001h
TRISL_TRISL5_MASK                        equ 0020h
TRISL_TRISL6_POSN                        equ 0006h
TRISL_TRISL6_POSITION                    equ 0006h
TRISL_TRISL6_SIZE                        equ 0001h
TRISL_TRISL6_LENGTH                      equ 0001h
TRISL_TRISL6_MASK                        equ 0040h
TRISL_TRISL7_POSN                        equ 0007h
TRISL_TRISL7_POSITION                    equ 0007h
TRISL_TRISL7_SIZE                        equ 0001h
TRISL_TRISL7_LENGTH                      equ 0001h
TRISL_TRISL7_MASK                        equ 0080h

// Register: PORTK
#define PORTK PORTK
PORTK                                    equ 0EE7h
// bitfield definitions
PORTK_RK0_POSN                           equ 0000h
PORTK_RK0_POSITION                       equ 0000h
PORTK_RK0_SIZE                           equ 0001h
PORTK_RK0_LENGTH                         equ 0001h
PORTK_RK0_MASK                           equ 0001h
PORTK_RK1_POSN                           equ 0001h
PORTK_RK1_POSITION                       equ 0001h
PORTK_RK1_SIZE                           equ 0001h
PORTK_RK1_LENGTH                         equ 0001h
PORTK_RK1_MASK                           equ 0002h
PORTK_RK2_POSN                           equ 0002h
PORTK_RK2_POSITION                       equ 0002h
PORTK_RK2_SIZE                           equ 0001h
PORTK_RK2_LENGTH                         equ 0001h
PORTK_RK2_MASK                           equ 0004h
PORTK_RK3_POSN                           equ 0003h
PORTK_RK3_POSITION                       equ 0003h
PORTK_RK3_SIZE                           equ 0001h
PORTK_RK3_LENGTH                         equ 0001h
PORTK_RK3_MASK                           equ 0008h
PORTK_RK4_POSN                           equ 0004h
PORTK_RK4_POSITION                       equ 0004h
PORTK_RK4_SIZE                           equ 0001h
PORTK_RK4_LENGTH                         equ 0001h
PORTK_RK4_MASK                           equ 0010h
PORTK_RK5_POSN                           equ 0005h
PORTK_RK5_POSITION                       equ 0005h
PORTK_RK5_SIZE                           equ 0001h
PORTK_RK5_LENGTH                         equ 0001h
PORTK_RK5_MASK                           equ 0020h
PORTK_RK6_POSN                           equ 0006h
PORTK_RK6_POSITION                       equ 0006h
PORTK_RK6_SIZE                           equ 0001h
PORTK_RK6_LENGTH                         equ 0001h
PORTK_RK6_MASK                           equ 0040h
PORTK_RK7_POSN                           equ 0007h
PORTK_RK7_POSITION                       equ 0007h
PORTK_RK7_SIZE                           equ 0001h
PORTK_RK7_LENGTH                         equ 0001h
PORTK_RK7_MASK                           equ 0080h

// Register: LATK
#define LATK LATK
LATK                                     equ 0EE8h
// bitfield definitions
LATK_LATK0_POSN                          equ 0000h
LATK_LATK0_POSITION                      equ 0000h
LATK_LATK0_SIZE                          equ 0001h
LATK_LATK0_LENGTH                        equ 0001h
LATK_LATK0_MASK                          equ 0001h
LATK_LATK1_POSN                          equ 0001h
LATK_LATK1_POSITION                      equ 0001h
LATK_LATK1_SIZE                          equ 0001h
LATK_LATK1_LENGTH                        equ 0001h
LATK_LATK1_MASK                          equ 0002h
LATK_LATK2_POSN                          equ 0002h
LATK_LATK2_POSITION                      equ 0002h
LATK_LATK2_SIZE                          equ 0001h
LATK_LATK2_LENGTH                        equ 0001h
LATK_LATK2_MASK                          equ 0004h
LATK_LATK3_POSN                          equ 0003h
LATK_LATK3_POSITION                      equ 0003h
LATK_LATK3_SIZE                          equ 0001h
LATK_LATK3_LENGTH                        equ 0001h
LATK_LATK3_MASK                          equ 0008h
LATK_LATK4_POSN                          equ 0004h
LATK_LATK4_POSITION                      equ 0004h
LATK_LATK4_SIZE                          equ 0001h
LATK_LATK4_LENGTH                        equ 0001h
LATK_LATK4_MASK                          equ 0010h
LATK_LATK5_POSN                          equ 0005h
LATK_LATK5_POSITION                      equ 0005h
LATK_LATK5_SIZE                          equ 0001h
LATK_LATK5_LENGTH                        equ 0001h
LATK_LATK5_MASK                          equ 0020h
LATK_LATK6_POSN                          equ 0006h
LATK_LATK6_POSITION                      equ 0006h
LATK_LATK6_SIZE                          equ 0001h
LATK_LATK6_LENGTH                        equ 0001h
LATK_LATK6_MASK                          equ 0040h
LATK_LATK7_POSN                          equ 0007h
LATK_LATK7_POSITION                      equ 0007h
LATK_LATK7_SIZE                          equ 0001h
LATK_LATK7_LENGTH                        equ 0001h
LATK_LATK7_MASK                          equ 0080h
LATK_LK0_POSN                            equ 0000h
LATK_LK0_POSITION                        equ 0000h
LATK_LK0_SIZE                            equ 0001h
LATK_LK0_LENGTH                          equ 0001h
LATK_LK0_MASK                            equ 0001h
LATK_LK1_POSN                            equ 0001h
LATK_LK1_POSITION                        equ 0001h
LATK_LK1_SIZE                            equ 0001h
LATK_LK1_LENGTH                          equ 0001h
LATK_LK1_MASK                            equ 0002h
LATK_LK2_POSN                            equ 0002h
LATK_LK2_POSITION                        equ 0002h
LATK_LK2_SIZE                            equ 0001h
LATK_LK2_LENGTH                          equ 0001h
LATK_LK2_MASK                            equ 0004h
LATK_LK3_POSN                            equ 0003h
LATK_LK3_POSITION                        equ 0003h
LATK_LK3_SIZE                            equ 0001h
LATK_LK3_LENGTH                          equ 0001h
LATK_LK3_MASK                            equ 0008h
LATK_LK4_POSN                            equ 0004h
LATK_LK4_POSITION                        equ 0004h
LATK_LK4_SIZE                            equ 0001h
LATK_LK4_LENGTH                          equ 0001h
LATK_LK4_MASK                            equ 0010h
LATK_LK5_POSN                            equ 0005h
LATK_LK5_POSITION                        equ 0005h
LATK_LK5_SIZE                            equ 0001h
LATK_LK5_LENGTH                          equ 0001h
LATK_LK5_MASK                            equ 0020h
LATK_LK6_POSN                            equ 0006h
LATK_LK6_POSITION                        equ 0006h
LATK_LK6_SIZE                            equ 0001h
LATK_LK6_LENGTH                          equ 0001h
LATK_LK6_MASK                            equ 0040h
LATK_LK7_POSN                            equ 0007h
LATK_LK7_POSITION                        equ 0007h
LATK_LK7_SIZE                            equ 0001h
LATK_LK7_LENGTH                          equ 0001h
LATK_LK7_MASK                            equ 0080h

// Register: TRISK
#define TRISK TRISK
TRISK                                    equ 0EE9h
// bitfield definitions
TRISK_TRISK0_POSN                        equ 0000h
TRISK_TRISK0_POSITION                    equ 0000h
TRISK_TRISK0_SIZE                        equ 0001h
TRISK_TRISK0_LENGTH                      equ 0001h
TRISK_TRISK0_MASK                        equ 0001h
TRISK_TRISK1_POSN                        equ 0001h
TRISK_TRISK1_POSITION                    equ 0001h
TRISK_TRISK1_SIZE                        equ 0001h
TRISK_TRISK1_LENGTH                      equ 0001h
TRISK_TRISK1_MASK                        equ 0002h
TRISK_TRISK2_POSN                        equ 0002h
TRISK_TRISK2_POSITION                    equ 0002h
TRISK_TRISK2_SIZE                        equ 0001h
TRISK_TRISK2_LENGTH                      equ 0001h
TRISK_TRISK2_MASK                        equ 0004h
TRISK_TRISK3_POSN                        equ 0003h
TRISK_TRISK3_POSITION                    equ 0003h
TRISK_TRISK3_SIZE                        equ 0001h
TRISK_TRISK3_LENGTH                      equ 0001h
TRISK_TRISK3_MASK                        equ 0008h
TRISK_TRISK4_POSN                        equ 0004h
TRISK_TRISK4_POSITION                    equ 0004h
TRISK_TRISK4_SIZE                        equ 0001h
TRISK_TRISK4_LENGTH                      equ 0001h
TRISK_TRISK4_MASK                        equ 0010h
TRISK_TRISK5_POSN                        equ 0005h
TRISK_TRISK5_POSITION                    equ 0005h
TRISK_TRISK5_SIZE                        equ 0001h
TRISK_TRISK5_LENGTH                      equ 0001h
TRISK_TRISK5_MASK                        equ 0020h
TRISK_TRISK6_POSN                        equ 0006h
TRISK_TRISK6_POSITION                    equ 0006h
TRISK_TRISK6_SIZE                        equ 0001h
TRISK_TRISK6_LENGTH                      equ 0001h
TRISK_TRISK6_MASK                        equ 0040h
TRISK_TRISK7_POSN                        equ 0007h
TRISK_TRISK7_POSITION                    equ 0007h
TRISK_TRISK7_SIZE                        equ 0001h
TRISK_TRISK7_LENGTH                      equ 0001h
TRISK_TRISK7_MASK                        equ 0080h

// Register: ODCON2
#define ODCON2 ODCON2
ODCON2                                   equ 0EEAh
// bitfield definitions
ODCON2_ECCP3OD_POSN                      equ 0000h
ODCON2_ECCP3OD_POSITION                  equ 0000h
ODCON2_ECCP3OD_SIZE                      equ 0001h
ODCON2_ECCP3OD_LENGTH                    equ 0001h
ODCON2_ECCP3OD_MASK                      equ 0001h
ODCON2_CCP4OD_POSN                       equ 0001h
ODCON2_CCP4OD_POSITION                   equ 0001h
ODCON2_CCP4OD_SIZE                       equ 0001h
ODCON2_CCP4OD_LENGTH                     equ 0001h
ODCON2_CCP4OD_MASK                       equ 0002h
ODCON2_CCP5OD_POSN                       equ 0002h
ODCON2_CCP5OD_POSITION                   equ 0002h
ODCON2_CCP5OD_SIZE                       equ 0001h
ODCON2_CCP5OD_LENGTH                     equ 0001h
ODCON2_CCP5OD_MASK                       equ 0004h
ODCON2_CCP6OD_POSN                       equ 0003h
ODCON2_CCP6OD_POSITION                   equ 0003h
ODCON2_CCP6OD_SIZE                       equ 0001h
ODCON2_CCP6OD_LENGTH                     equ 0001h
ODCON2_CCP6OD_MASK                       equ 0008h
ODCON2_CCP7OD_POSN                       equ 0004h
ODCON2_CCP7OD_POSITION                   equ 0004h
ODCON2_CCP7OD_SIZE                       equ 0001h
ODCON2_CCP7OD_LENGTH                     equ 0001h
ODCON2_CCP7OD_MASK                       equ 0010h
ODCON2_CCP8OD_POSN                       equ 0005h
ODCON2_CCP8OD_POSITION                   equ 0005h
ODCON2_CCP8OD_SIZE                       equ 0001h
ODCON2_CCP8OD_LENGTH                     equ 0001h
ODCON2_CCP8OD_MASK                       equ 0020h
ODCON2_CCP9OD_POSN                       equ 0006h
ODCON2_CCP9OD_POSITION                   equ 0006h
ODCON2_CCP9OD_SIZE                       equ 0001h
ODCON2_CCP9OD_LENGTH                     equ 0001h
ODCON2_CCP9OD_MASK                       equ 0040h
ODCON2_CCP10OD_POSN                      equ 0007h
ODCON2_CCP10OD_POSITION                  equ 0007h
ODCON2_CCP10OD_SIZE                      equ 0001h
ODCON2_CCP10OD_LENGTH                    equ 0001h
ODCON2_CCP10OD_MASK                      equ 0080h

