GopalSaraf/Practicals/PSDL/include/proc/pic18f96j99.inc
// Register: MDSRC
#define MDSRC MDSRC
MDSRC                                    equ 0EEEh
// bitfield definitions
MDSRC_MDSRC_POSN                         equ 0000h
MDSRC_MDSRC_POSITION                     equ 0000h
MDSRC_MDSRC_SIZE                         equ 0004h
MDSRC_MDSRC_LENGTH                       equ 0004h
MDSRC_MDSRC_MASK                         equ 000Fh
MDSRC_MDSODIS_POSN                       equ 0007h
MDSRC_MDSODIS_POSITION                   equ 0007h
MDSRC_MDSODIS_SIZE                       equ 0001h
MDSRC_MDSODIS_LENGTH                     equ 0001h
MDSRC_MDSODIS_MASK                       equ 0080h
MDSRC_MDSRC0_POSN                        equ 0000h
MDSRC_MDSRC0_POSITION                    equ 0000h
MDSRC_MDSRC0_SIZE                        equ 0001h
MDSRC_MDSRC0_LENGTH                      equ 0001h
MDSRC_MDSRC0_MASK                        equ 0001h
MDSRC_MDSRC1_POSN                        equ 0001h
MDSRC_MDSRC1_POSITION                    equ 0001h
MDSRC_MDSRC1_SIZE                        equ 0001h
MDSRC_MDSRC1_LENGTH                      equ 0001h
MDSRC_MDSRC1_MASK                        equ 0002h
MDSRC_MDSRC2_POSN                        equ 0002h
MDSRC_MDSRC2_POSITION                    equ 0002h
MDSRC_MDSRC2_SIZE                        equ 0001h
MDSRC_MDSRC2_LENGTH                      equ 0001h
MDSRC_MDSRC2_MASK                        equ 0004h
MDSRC_MDSRC3_POSN                        equ 0003h
MDSRC_MDSRC3_POSITION                    equ 0003h
MDSRC_MDSRC3_SIZE                        equ 0001h
MDSRC_MDSRC3_LENGTH                      equ 0001h
MDSRC_MDSRC3_MASK                        equ 0008h

// Register: MDCON
#define MDCON MDCON
MDCON                                    equ 0EEFh
// bitfield definitions
MDCON_MDBIT_POSN                         equ 0000h
MDCON_MDBIT_POSITION                     equ 0000h
MDCON_MDBIT_SIZE                         equ 0001h
MDCON_MDBIT_LENGTH                       equ 0001h
MDCON_MDBIT_MASK                         equ 0001h
MDCON_MDO_POSN                           equ 0003h
MDCON_MDO_POSITION                       equ 0003h
MDCON_MDO_SIZE                           equ 0001h
MDCON_MDO_LENGTH                         equ 0001h
MDCON_MDO_MASK                           equ 0008h
MDCON_MDOPOL_POSN                        equ 0004h
MDCON_MDOPOL_POSITION                    equ 0004h
MDCON_MDOPOL_SIZE                        equ 0001h
MDCON_MDOPOL_LENGTH                      equ 0001h
MDCON_MDOPOL_MASK                        equ 0010h
MDCON_MDSLR_POSN                         equ 0005h
MDCON_MDSLR_POSITION                     equ 0005h
MDCON_MDSLR_SIZE                         equ 0001h
MDCON_MDSLR_LENGTH                       equ 0001h
MDCON_MDSLR_MASK                         equ 0020h
MDCON_MDOE_POSN                          equ 0006h
MDCON_MDOE_POSITION                      equ 0006h
MDCON_MDOE_SIZE                          equ 0001h
MDCON_MDOE_LENGTH                        equ 0001h
MDCON_MDOE_MASK                          equ 0040h
MDCON_MDEN_POSN                          equ 0007h
MDCON_MDEN_POSITION                      equ 0007h
MDCON_MDEN_SIZE                          equ 0001h
MDCON_MDEN_LENGTH                        equ 0001h
MDCON_MDEN_MASK                          equ 0080h

// Register: PMD4
#define PMD4 PMD4
PMD4                                     equ 0EF0h
// bitfield definitions
PMD4_EMBMD_POSN                          equ 0000h
PMD4_EMBMD_POSITION                      equ 0000h
PMD4_EMBMD_SIZE                          equ 0001h
PMD4_EMBMD_LENGTH                        equ 0001h
PMD4_EMBMD_MASK                          equ 0001h
PMD4_LVDMD_POSN                          equ 0002h
PMD4_LVDMD_POSITION                      equ 0002h
PMD4_LVDMD_SIZE                          equ 0001h
PMD4_LVDMD_LENGTH                        equ 0001h
PMD4_LVDMD_MASK                          equ 0004h
PMD4_IOCMD_POSN                          equ 0003h
PMD4_IOCMD_POSITION                      equ 0003h
PMD4_IOCMD_SIZE                          equ 0001h
PMD4_IOCMD_LENGTH                        equ 0001h
PMD4_IOCMD_MASK                          equ 0008h
PMD4_USBMD_POSN                          equ 0004h
PMD4_USBMD_POSITION                      equ 0004h
PMD4_USBMD_SIZE                          equ 0001h
PMD4_USBMD_LENGTH                        equ 0001h
PMD4_USBMD_MASK                          equ 0010h
PMD4_CMP3MD_POSN                         equ 0005h
PMD4_CMP3MD_POSITION                     equ 0005h
PMD4_CMP3MD_SIZE                         equ 0001h
PMD4_CMP3MD_LENGTH                       equ 0001h
PMD4_CMP3MD_MASK                         equ 0020h
PMD4_CMP2MD_POSN                         equ 0006h
PMD4_CMP2MD_POSITION                     equ 0006h
PMD4_CMP2MD_SIZE                         equ 0001h
PMD4_CMP2MD_LENGTH                       equ 0001h
PMD4_CMP2MD_MASK                         equ 0040h
PMD4_CMP1MD_POSN                         equ 0007h
PMD4_CMP1MD_POSITION                     equ 0007h
PMD4_CMP1MD_SIZE                         equ 0001h
PMD4_CMP1MD_LENGTH                       equ 0001h
PMD4_CMP1MD_MASK                         equ 0080h

// Register: PMD3
#define PMD3 PMD3
PMD3                                     equ 0EF1h
// bitfield definitions
PMD3_REFO2MD_POSN                        equ 0000h
PMD3_REFO2MD_POSITION                    equ 0000h
PMD3_REFO2MD_SIZE                        equ 0001h
PMD3_REFO2MD_LENGTH                      equ 0001h
PMD3_REFO2MD_MASK                        equ 0001h
PMD3_REFO1MD_POSN                        equ 0001h
PMD3_REFO1MD_POSITION                    equ 0001h
PMD3_REFO1MD_SIZE                        equ 0001h
PMD3_REFO1MD_LENGTH                      equ 0001h
PMD3_REFO1MD_MASK                        equ 0002h
PMD3_PSPMD_POSN                          equ 0002h
PMD3_PSPMD_POSITION                      equ 0002h
PMD3_PSPMD_SIZE                          equ 0001h
PMD3_PSPMD_LENGTH                        equ 0001h
PMD3_PSPMD_MASK                          equ 0004h
PMD3_LCDMD_POSN                          equ 0003h
PMD3_LCDMD_POSITION                      equ 0003h
PMD3_LCDMD_SIZE                          equ 0001h
PMD3_LCDMD_LENGTH                        equ 0001h
PMD3_LCDMD_MASK                          equ 0008h
PMD3_RTCCMD_POSN                         equ 0004h
PMD3_RTCCMD_POSITION                     equ 0004h
PMD3_RTCCMD_SIZE                         equ 0001h
PMD3_RTCCMD_LENGTH                       equ 0001h
PMD3_RTCCMD_MASK                         equ 0010h
PMD3_ADCMD_POSN                          equ 0005h
PMD3_ADCMD_POSITION                      equ 0005h
PMD3_ADCMD_SIZE                          equ 0001h
PMD3_ADCMD_LENGTH                        equ 0001h
PMD3_ADCMD_MASK                          equ 0020h
PMD3_CTMUMD_POSN                         equ 0006h
PMD3_CTMUMD_POSITION                     equ 0006h
PMD3_CTMUMD_SIZE                         equ 0001h
PMD3_CTMUMD_LENGTH                       equ 0001h
PMD3_CTMUMD_MASK                         equ 0040h
PMD3_MODMD_POSN                          equ 0007h
PMD3_MODMD_POSITION                      equ 0007h
PMD3_MODMD_SIZE                          equ 0001h
PMD3_MODMD_LENGTH                        equ 0001h
PMD3_MODMD_MASK                          equ 0080h
PMD3_TXMMD_POSN                          equ 0007h
PMD3_TXMMD_POSITION                      equ 0007h
PMD3_TXMMD_SIZE                          equ 0001h
PMD3_TXMMD_LENGTH                        equ 0001h
PMD3_TXMMD_MASK                          equ 0080h

